trade/src/InformationRegisters/УчетныеЗаписиЭДО/УчетныеЗаписиЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЗаписиЭДО</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеУчетнойЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочтаДляУведомлений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОжидатьИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНовыхПриглашениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОбОтветахНаПриглашения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНовыхДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОНеОбработанныхДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлятьОбОкончанииСрокаДействияСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресОрганизацииЗначение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаСоглашенияНаРоуминг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеСоглашенияНаРоуминг</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоглашенияНаРоуминг</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассивноеСоединениеFTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПортFTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПутьFTP</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>EmailОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НазначениеУчетнойЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеУчетнойЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновитьНастройкиУведомлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятыУсловияИспользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОблачныйЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОператораЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/УчетныеЗаписиЭДО/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	СтарыйНабор = ОбщегоНазначения.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение, "Организация");
	
	ОрганизацииВНаборе = ОбщегоНазначения.ВыгрузитьКолонку(ЭтотОбъект, "Организация", Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОрганизацииВНаборе, СтарыйНабор.ВыгрузитьКолонку("Организация"), Истина);
	
	ДополнительныеСвойства.Вставить("ОрганизацииВНаборе", ОрганизацииВНаборе);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&Организации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА УчетныеЗаписиЭДО.ИдентификаторЭДО ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Состояние,
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписиЭДО
	|		ПО Организации.Ссылка = УчетныеЗаписиЭДО.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	Организации.Ссылка";
	
	Запрос.УстановитьПараметр("Организации", ДополнительныеСвойства.ОрганизацииВНаборе);
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ТаблицаОрганизаций = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаТЗ Из ТаблицаОрганизаций Цикл
			НаборЗаписей = РегистрыСведений.СостояниеОрганизацийБЭД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(СтрокаТЗ.Организация);
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТЗ);
			НаборЗаписей.Записать();
		КонецЦикла;
		
	Исключение
		
		Информация = ИнформацияОбОшибке();
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Обновление регистра ""Состояние организаций БЭД""'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация),
			НСтр("ru = 'Не удалось обновить данные об организация подключенных к ЭДО'"));
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
